---
type: AnnotationSymbol
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# AnnotationSymbol

`Autodesk.Revit.DB.AnnotationSymbol` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetLeaders | 2016 | `public IList < Leader > GetLeaders ()` |
| Method | addLeader | — | `public void addLeader ()` |
| Method | duplicate | — | `public AnnotationSymbol duplicate ()` |
| Method | removeLeader | — | `public void removeLeader ()` |
| Property | AnnotationSymbolType | — | `public AnnotationSymbolType AnnotationSymbolType { get ; set ; }` |
| Property | FromRoom | — | `` |
| Property | Parameter | — | `` |
| Property | Room | — | `` |
| Property | Space | — | `` |
| Property | ToRoom | — | `` |